{"pages":[],"posts":[{"title":"Hello World","text":"Welcome to Hexo! This is your very first post. Check documentation for more info. If you get any problems when using Hexo, you can find the answer in troubleshooting or you can ask me on GitHub. Quick StartCreate a new post1$ hexo new \"My New Post\" More info: Writing Run server1$ hexo server More info: Server Generate static files1$ hexo generate More info: Generating Deploy to remote sites1$ hexo deploy More info: Deployment","link":"/2020/05/04/hello-world/"},{"title":"开博大吉大利，今晚肝到底！","text":"","link":"/2020/05/04/%E5%BC%80%E5%8D%9A%E5%A4%A7%E5%90%89%E5%A4%A7%E5%88%A9%EF%BC%8C%E4%BB%8A%E6%99%9A%E8%82%9D%E5%88%B0%E5%BA%95%EF%BC%81/"},{"title":"这是我的第二篇博客，只用于测试","text":"","link":"/2020/05/04/%E8%BF%99%E6%98%AF%E6%88%91%E7%9A%84%E7%AC%AC%E4%BA%8C%E7%AF%87%E5%8D%9A%E5%AE%A2%EF%BC%8C%E5%8F%AA%E7%94%A8%E4%BA%8E%E6%B5%8B%E8%AF%95/"},{"title":"到底什么是“脚本”","text":"为什么有些行业总是喜欢把一些简单的概念说得晦涩难懂，有时候是为了装逼，有时候为了拉高行业门槛，有时候是这个概念就是这样的，也就是行业内的专有名词。而我一直以为“脚本”这个名词是视频从业者和程序员为了拉高行业门槛而设立的，经过了学习之后，我觉得我是个无知的人，“脚本”这个词，就像是“设计”这个词一样简单、明确。 先让我们来看看这个词词语的本意： 其实在视频拍摄剪辑和编程领域，脚本的意思都是一样的，本质上都是“逐行执行”的意思，更好的理解就是：“脚”是一步一步的意思，“本”是文本的意思，所以结合起来，就是“一步一步执行的文本”，从视频拍摄的角度来看，剧本和脚本就是一步一步，一行一行执行的文本，在编程领域，程序要是逐行执行的，所以说脚本这个解释实在是太贴切了。包括脚本之间的注释也是一样的，视频拍摄脚本的注释也不用念出来，编程行业里面的注释也有异曲同工之妙。 这是理解前端编程，甚至整个计算机编程的核心和灵魂，在日常的编程中，我们很少会在意这些“基础中的基础”，有些人是开始学习的时候，就没有意识到脚本这个概念的重要性，有些人是已经内化到自己的编程和思维意识里面去了。看似很不重要的一个概念，其实决定了一个开发者的开发能力。前者是码农，后者则是大佬。就是这些诸如脚本的概念组成了编程开发世界的基础，也决定了一个开发者是否有从全局，甚至是底层看问题的逻辑思维。这些，很基础，但很重要。","link":"/2020/05/07/%E5%88%B0%E5%BA%95%E4%BB%80%E4%B9%88%E6%98%AF%E2%80%9C%E8%84%9A%E6%9C%AC%E2%80%9D/"},{"title":"HTTP到底是什么，你细品","text":"我好累，但是我好想写代码，我不行做运营，我一定要突破！一定要加油！ 注意，http是前端的底层知识，在前端学习起着非常重要的作用。","link":"/2020/05/20/HTTP%E5%88%B0%E5%BA%95%E6%98%AF%E4%BB%80%E4%B9%88%EF%BC%8C%E4%BD%A0%E7%BB%86%E5%93%81/"},{"title":"resume","text":"","link":"/2020/05/21/resume/"},{"title":"重拾HTML","text":"写在前面：几年没有学习coding了，现在有时间，有精力重新选择我人生的方向，我还是毫不犹豫的决定从成为一个developer开始，我也毫不犹豫的选择从成为一个前端开发者开始。当然如果我真的要把coding当成我的事业，我我必须要重新开始，从0开始！所以就有了这篇——重拾html 首先当然是去了解HTML的，HTML全称、历史、版本和规范文档自然是不能少，我们可以大致浏览一下，不必去深入研究，可以在学习很累的时候看，了解一下前端的发展史也是一件有趣的事。（插入关于HTML的全称、历史、版本和规范文档） 1、除了 HTML 5 的 DOCTYPE，其他的都 TM 很难记：https://www.w3.org/QA/2002/04/valid-dtd-list.html如果你没写 DOCTYPE，那你就惨了 2、具体说到HTML5，html / head / body这三个标签是必须有，也是必须学习的 这里引出了一个问题，一个HTML网页到底哪些标签的是必须的？（总结和回顾一下HTML必须要有的标签） 3、常见的HTML标签a、form、input、button、h1、p、ul、ol、small、strong、div、span、kbd、video、audio、svg没有接触算法和数据结构的时候，在学习编程的初期，其实就是学习英语单词。想要熟练的记住所有标签的含义，除了不断地使用这些标签，另一个更好的方法就是去记这些标签的英文全称。 例如：标签：anchor 的缩写。anchor [‘æŋkə] 基本zhidao解释n. 锚, 铁锚的。＜li＞：List Item列表项目，注意不是list，而是List Item＜ol＞：Ordered List 排序列回表＜ul＞：Unordered List 不排序列表＜i＞：Italic 斜体答（文本）＜b＞：Bold 粗体（文本） 总的来说，HTML相比CSS是最简单的，在熟悉了基本语法之后，应该建立信心，要多看页面的基本结构，看到页面布局的时候，要多从float，flex的角度去考虑布局和排版的问题，OK，他还HTML的内容就这些。 CSS到了css的知识就很多了，如果说HTML是网页的毛坯房，那么css就是在这个毛坯房子上装修，不仅内容多，而且\u0010要注重的细节也很多，最最坑的是css的布局排版在不断的进化，要踩的坑特别多，所以说才有那么多的前端UI库会被编写出来，目前我还没有学到UI库那一块去，希望之后我能编写出大家都在使用的UI库来。 芳芳老师其实说到一点我非常认同，在学习HTML和css的过程当中，先要做的不是系统性的学习，因为是新的HTML和现有的css知识实在是太多了，我们专注这个学习实在是太难了，因为还有更多的知识等着我们学习，所以，我们必须采用螺旋式上升的方式去学习。就像纠错本一样，踩到一个坑，我就把填坑技巧给记录下来，做成一个自己的学习错题本，然后继续向前走，等把核心知识都学习完了，所有必须踩的坑也全部踩完了。 下面就是我在学习中归纳的一些常见但很容易被忽视的知识点（坑）1、","link":"/2020/05/21/%E9%87%8D%E6%8B%BEHTML/"}],"tags":[],"categories":[]}